--Á½ºşÇø °ÍÁêÏØ ÌìÍõ½«Áì¶Ô»°
--°ÍÁêÏØĞÂÊÖÈÎÎñ£ºĞ¡ÓæµÄµùµù
--suyu

function main(sel)

UTask_world18 = GetTask(46);

if(UTask_world18 == 1) then
	Say("ÌìÍõµÜ×Ó£ºèÁèËÍè°¡£¬¼ÈÈ»ÊÇ¾ÈÈËµÄ£¬ÄÇ×ÔÈ»ÊÇÒå²»Èİ´Ç£¬ËäÈ»°ïÀïµÄµÜĞÖÃÇÒ²µÈ×ÅÓÃ£¬ÎÒ¾ÍËÍÄãÒ»¿Å°É¡£",0)
	AddEventItem("èÁèËÍè")
	SetTask(46, 2)
	Msg2Player("ÄãµÃµ½Ò»¿ÅèÁèËÍè¡£")
return
end;

if (GetFaction() ~= "") then						--Èç¹ûÍæ¼ÒÒÑ¾­ÊôÓÚÄ³Ò»ÃÅÅÉ
	if (GetFaction() == "¶ëáÒÅÉ") then				
		Say("ÌìÍõ½«Áì£º±Ö°ï°ïÖ÷³£³£¸úÊôÏÂÃÇÌáÆğ¹óÅÉ£¬¶Ô¹óÅÉÕÆÃÅÇåÏşÊ¦Ì«Ò»Ö±¶¼ÊÇÊ®·Ö¾´Ä½µÄ¡£", 0)
	end
	if (GetFaction() == "´äÑÌÃÅ") then				
		Say("ÌìÍõ½«Áì£ºÅ®ÈËÂé·³£¬Æ¯ÁÁµÄÅ®ÈËÓÈÆäÂé·³£¬»áÎä¹¦µÄÆ¯ÁÁÅ®ÈË¸üÊÇÂé·³ÖĞµÄÂé·³£¬¹óÅÉµÄÈËÔÛ¿É²»¸ÒÕĞÈÇ£¡", 0)
	end
	if (GetFaction() == "ÌÆÃÅ") then				
		Say("ÌìÍõ½«Áì£ºÑ§ÎäÖ®ÈËÓ¦¸Ã¹âÃ÷ÀÚÂä£¬ÎÒ×îÌÖÑáÄÇĞ©Ê¹°µÆ÷¡¢ÏÂ¶¾Ò©µÄ¼û²»µÃ¹âµÄĞĞ¾¶£¡", 0)
	end
	if (GetFaction() == "Îå¶¾½Ì") then				
		Say("ÌìÍõ½«Áì£º±¾°ïËäÈ»²»ÃÔĞÅÈÎºÎÃûÃÅÕıÅÉ£¬µ«ÊÇÒ²²»Ğ¼ÓëÄÇĞ©Ê¹¹ÆÏÂ¶¾Ö®Í½ÎªÎé£¡", 0)
	end
	if (GetFaction() == "ÌìÍõ°ï") then				
		Say("ÌìÍõ½«Áì£ºĞÖµÜÓĞÊÂÂğ£¿", 0)
	end
	if (GetFaction() == "ÉÙÁÖÅÉ") then				
		Say("ÌìÍõ½«Áì£ºÉÙÁÖ¹¦·òËäÈ»ºÅ³ÆÎäÁÖÕı×Ú£¬µ«ÊÇÎÒÈ´²»ÔõÃ´·şÆø£¬ºÍÉĞºÃºÃÄî¾­²ÅÊÇÕı¾­£¬Ñ§Ê²Ã´ÈË´ò¼Ü£¬ÊµÔÚÓĞÎ¥ÇåĞŞÖ®µÀ¡£", 0)
	end
	if (GetFaction() == "Îäµ±ÅÉ") then				
		Say("ÌìÍõ½«Áì£º´«Ëµ¹óÅÉµÄµÀÒ»ÕæÈËÎä¹¦Éî²»¿É²â£¬²»ÖªÊ²Ã´Ê±ºòÓĞ»ú»á¼ûµ½¡£", 0)
	end
	if (GetFaction() == "À¥ÂØÅÉ") then				
		Say("ÌìÍõ½«Áì£º¹óÅÉ½üÄêÀ´·¢Õ¹ÉñËÙ£¬Ïë±ØÒ²²»ÊÇÀËµÃĞéÃû£¬Ö»ÊÇ±ğ°ÑÖĞÔ­ÎäÁÖ¶¼¿´±âÁË£¡", 0)
	end
	if (GetFaction() == "ÌìÈÌ½Ì") then				
		Say("ÌìÍõ½«Áì£ºÔÛÃÇ¿É²»ºÍ½ğÈË´òÊ²Ã´½»µÀ£¡", 0)
	end
	if (GetFaction() == "Ø¤°ï") then				
		Say("ÌìÍõ½«Áì£º¹ó°ïÓë±¾°ïºÅ³ÆÌìÏÂÁ½´ó°ï£¬ÓĞ»ú»áÔÛÃÇÒªºÃºÃÇ×½üÇ×½ü¡£", 0)
	end
else	
	UTask_tw = GetTask(3)
	if (UTask_tw == 0) then						--Î´Èë¹ıÌìÍõ°ï
		-- Talk(3, "select", "ÌìÍõ½«Áì£º±¾°ï°ïÖ÷ÑîçøÔÚ½­ºşÉÏºÕºÕÓĞÃû£¬±ğ¿´ËıÊÇ¸öÅ®×Ó£¬µ«ÊÇÎäÒÕ¸ßÇ¿£¬µ¨Ê¶¹ıÈË£¬²»ÈÃĞëÃ¼£¬°ïÀïµÄĞÖµÜÃÇ¶¼·şËı£¡", "±¾°ï°ïÖÚ±é²¼Á½ºş£¬ÈË¶àÊÆ´ó£¬ÌìÏÂÎŞÈË¸ÒĞ¡êïÔÛÃÇ£¡", "±¾°ï¼È¿¹½ğ±ø¡¢Ò²·´ËÎÍ¢£¬ĞÖµÜÃÇ¶¼ÊÇÆ¶¿à°ÙĞÕ³öÉí£¬´³µ´½­ºşÒ²Ö»ÊÇÎªÁËÓĞÌõ»îÂ·¡£ÄÄ¸ö»ÊµÛ×ø½­É½£¬¸úÔÛÃÇ¿ÉÃ»Ê²Ã´¹ØÏµ£¡")
	Talk(1,"","Xin chµo c¸c h");
	return	
	end
	if (UTask_tw == 70) then					--ÌìÍõ°ï³öÊ¦
		Say("MÊy th»ng lån m«n ph¸i bŞ h­", 0)
	return	
	end
	Say("ÌìÍõ½«Áì£ºÄãÒÑ¾­ÔÚÌìÍõµºËïµÀÁì´¦½ÓÁË±¾°ïµÄÈëÃÅÈÎÎñ£¬µ«ÊÇÉĞÎ´Íê³É£¬ÄãĞèÒªÈ¥°ÍÁêÏØ¾Æ¹İÂòµ½ÃÀ¾Æ¡°ÅîÀ³´º¡±", 0)
end;

end;



function select()
Say("ÌìÍõ½«Áì£ºÄãÏë¼ÓÈë±¾°ïÂğ£¿", 2, "¼ÓÈë/yes", "²»¼ÓÈë/no");
end;


function yes()
if (GetSeries() ~= 0) then							--Èç¹ûÍæ¼Ò²»ÊôÓÚ½ğÏµ
	Say("ÌìÍõ½«Áì£ºÒÔÄãµÄ×ÊÖÊºÍ¸ù¹Ç²»ÊÊºÏĞŞÁ·±¾ÃÅÎä¹¦£¬ÎÒÃÇ²»ÏëÎóÈË×ÓµÜ£¬Äã»¹ÊÇÁíÍ¶Ã÷Ê¦°É£¡", 0)
else
	if (GetLevel() >= 10) then					--µÈ¼¶´ïµ½Ê®¼¶
		if ( GetSex() == 1 ) then 				--Íæ¼ÒĞÔ±ğÎªÅ®
			Say("ÌìÍõ½«Áì£º±¾°ï°ïÖÚ¶¼ÊÇĞ©´ÖºÀ´óºº£¬ÏñÄãÕâÑù½¿µÎµÎµÄ¹ÃÄï¿É²»ÊÊºÏ±¾°ï¡£", 0)
		else							--Íæ¼ÒĞÔ±ğÎªÄĞ
			Say("ÌìÍõ½«Áì£ºÄã¼ÓÈë±¾°ï£¬ÔÛÃÇ¾ÍÊÇÒ»¼ÒĞÖµÜÀ²£¬´ó»ïÓĞ¸£Í¬Ïí£¬ÓĞÄÑÍ¬µ±£¬ºäºäÁÒÁÒµØ´ó¸ÉÒ»³¡£¡", 2, "½øÈëÌìÍõ°ï/go", "ÎÒÔÙÏëÏë/no")	   				
		end
	else
		Say("ÌìÍõ½«Áì£ºÑ§ÎäÖ®ÈË£¬Ë­Ã»Á÷¹ıÑª¡¢Á÷¹ıº¹£¿ÅÂ¿à¿É²»ĞĞ£¡ÏÈ³ö´åºÃºÃÁ·Ò»Á·£¬´òºÃ¸ù»ùµ½ÁË<color=Red>Ê®¼¶<color>ÔÙÀ´ÕÒÎÒ¡£", 0)
	end
end;			
end;

function no()
end;


function go()
NewWorld(59, 1425, 3472)			--°ÑÍæ¼Ò´«ËÍµ½ÃÅÅÉÈë¿Ú
SetFightState(1)				--Íæ¼Ò½øÈë·ÇÕ½¶·ÇøÓò£¬È¡ÏûÕ½¶·×´Ì¬×ª»»	
SetRevPos(59,21)	  				--ÉèÖÃÖØÉúµã
SetTask(3, 10)
SetFaction("ÌìÍõ°ï")       			--Íæ¼Ò¼ÓÈëÌìÍõ°ï
SetCamp(3)
SetCurCamp(3)
AddMagic(29)
AddMagic(30)
AddMagic(31)
--AddMagic(32)
--AddMagic(33)
--AddMagic(34)
--AddMagic(35)
--AddMagic(36)
--AddMagic(37)
--AddMagic(38)
--AddMagic(39)
--AddMagic(40)
--AddMagic(41)
--AddMagic(42)
--SetRank(43)
Msg2Player("»¶Ó­Äã¼ÓÈëÌìÍõ°ï£¬ÏÈ´ÓÒ»¸öĞ¡Ğ¡µÄÊÌÎÀ×öÆğ°É£¡")
--Msg2Player("Ñ§»áÌìÍõ°ïÎä¹¦¡°Õ¶Áú¾÷¡±¡£")
end;